{
  "bearing_type": {
    "name": "Bearing Type",
    "description": "The mechanical system that allows the tonearm to move freely in both horizontal and vertical planes.",
    "categories": [
      {
        "id": "gimbal",
        "name": "Gimbal",
        "description": "A robust and common design using two pairs of bearings on perpendicular axes. Known for stability and solid bass performance."
      },
      {
        "id": "unipivot",
        "name": "Unipivot",
        "description": "The arm balances on a single sharp point. Known for a lively, open, and 'free' sound, but can be more challenging to set up."
      },
      {
        "id": "knife_edge",
        "name": "Knife-Edge",
        "description": "The arm rests on a sharp, hardened 'knife' edge. A classic design that aims to combine the stability of a gimbal with low friction."
      },
      {
        "id": "magnetic",
        "name": "Magnetic",
        "description": "Uses magnetic levitation or stabilization for a non-contact pivot. Can be part of a gimbal or unipivot design."
      }
    ]
  },
  "arm_material": {
    "name": "Armtube Material",
    "description": "The material used for the main tonearm tube, chosen for its balance of stiffness, low mass, and damping properties.",
    "categories": [
      {
        "id": "aluminum",
        "name": "Aluminum",
        "description": "The most common material. Offers an excellent balance of performance and cost. Can be straight, tapered, or treated."
      },
      {
        "id": "carbon_fibre",
        "name": "Carbon Fibre",
        "description": "Very light, stiff, and well-damped. Popular in modern low-to-medium mass tonearms."
      },
      {
        "id": "magnesium",
        "name": "Magnesium",
        "description": "Lighter and better-damped than aluminum. Used in high-performance arms like the SME Series V."
      },
      {
        "id": "titanium",
        "name": "Titanium",
        "description": "Extremely stiff and strong. Used in very high-end arms, often for critical parts or the entire tube."
      },
      {
        "id": "stainless_steel",
        "name": "Stainless Steel",
        "description": "Very rigid and heavy. Often used in high-mass tonearms designed for low-compliance cartridges."
      },
      {
        "id": "wood",
        "name": "Wood",
        "description": "Used for its unique resonance characteristics and natural damping. Can provide a warm, organic sound."
      },
      {
        "id": "glass",
        "name": "Glass / Quartz",
        "description": "Used in some specific designs for its stiffness and stability, like the Souther linear tracking arm."
      },
      {
        "id": "resin",
        "name": "Resin / 3D-Printed",
        "description": "Used in modern designs, often 3D-printed, to create complex shapes and control resonances."
      },
      {
        "id": "kevlar",
        "name": "Kevlar Composite",
        "description": "An advanced composite material known for its high strength-to-weight ratio and damping properties."
      },
      {
        "id": "acrylic",
        "name": "Acrylic",
        "description": "Used for its specific resonance characteristics and often for aesthetic reasons."
      }
    ]
  },
  "arm_shape": {
    "name": "Armtube Shape",
    "description": "The general shape of the tonearm tube, which affects resonance, rigidity, and aesthetics.",
    "categories": [
      {
        "id": "straight",
        "name": "Straight",
        "description": "A direct, straight tube from pivot to headshell. The most common modern design, often offering the highest rigidity for its mass."
      },
      {
        "id": "s_shape",
        "name": "S-Shape",
        "description": "A classic design with a gentle 'S' curve. Popular on many vintage Japanese tonearms and still used today, often with removable headshells."
      },
      {
        "id": "j_shape",
        "name": "J-Shape",
        "description": "Similar to an S-shape but with a more pronounced final curve towards the headshell. A classic aesthetic."
      }
    ]
  },
  "headshell_connector": {
    "name": "Headshell Connector Type",
    "description": "The type of connection used for removable headshells.",
    "categories": [
      {
        "id": "integrated",
        "name": "Integrated",
        "description": "The headshell is a fixed, non-removable part of the armtube. Offers maximum rigidity but less flexibility."
      },
      {
        "id": "sme_universal",
        "name": "SME / Universal 4-Pin",
        "description": "The industry standard bayonet connector, also known as H-4. Allows for easy swapping of cartridges mounted on different headshells."
      },
      {
        "id": "proprietary",
        "name": "Proprietary",
        "description": "A unique connector specific to the manufacturer (e.g., some Dual, Lenco, or B&O models)."
      }
    ]
  },
  "tracking_method": {
    "name": "Tracking Method",
    "description": "The fundamental way the tonearm tracks the record groove, either by pivoting from a fixed point or moving linearly across the record.",
    "categories": [
      {
        "id": "pivoting",
        "name": "Pivoting",
        "description": "The most common tonearm design, where the arm pivots from a single fixed point. It tracks the record in an arc."
      },
      {
        "id": "tangential_air_bearing",
        "name": "Tangential (Air Bearing)",
        "description": "A linear tracking arm that moves on a cushion of air to maintain tangency to the groove across the entire record."
      },
      {
        "id": "tangential_mechanical",
        "name": "Tangential (Mechanical)",
        "description": "A linear tracking arm that moves along a physical rail or mechanism to maintain tangency to the groove."
      },
      {
        "id": "tangential_pivot",
        "name": "Tangential (Pivoting/Thales)",
        "description": "A specific type of pivoting arm (e.g., Thales, Schroeder LT) that uses a complex pivot arrangement to mimic linear tracking with very low tracking error."
      }
    ]
  }
}
